Revit 2026 API

# SharedParameterElementLookup Method

---

Finds the shared parameter element that corresponds to the given Guid.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static SharedParameterElement Lookup(
	Document document,
	Guid guidValue
)
```
```vb
Public Shared Function Lookup (
	document As Document,
	guidValue As Guid
) As SharedParameterElement
```
```cpp
public:
static SharedParameterElement^ Lookup(
	Document^ document,
	Guid guidValue
)
```
```fsharp
static member Lookup :
        document : Document *
        guidValue : Guid -> SharedParameterElement
```

#### Parameters

document Document
     The document.
guidValue Guid
     Shared parameter Guid.

#### Return Value

SharedParameterElement The retrieved shared parameter instance, or  if the matching element is not found.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

SharedParameterElement Class

Autodesk.Revit.DB Namespace